In [2]:
import numpy as np
import pandas as pd

In [ ]:
bric_dat_set = pd.read_csv("brics.csv")
# on reading data in pandas there is always be an index column which is not actually part of the dataset.
bric_dat_set

  Code       country    capital    area  population
0   BR        Brazil   Brasilia   8.516      200.40
1   RU        Russia     Moscow  17.100      143.50
2   IN         India  New Delhi   3.286     1252.00
3   CH         China    Beijing   9.597     1357.00
4   SA  South Africa   Pretoria   1.221       52.98

In [4]:
bric_dat_set.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Code        5 non-null      object
 1   country     5 non-null      object
 2   capital     5 non-null      object
 3   area        5 non-null      float64
 4   population  5 non-null      float64
dtypes: float64(2), object(3)
memory usage: 332.0+ bytes

In [9]:
bric_dat_set.isna().count()

Code          5
country       5
capital       5
area          5
population    5
dtype: int64

slicing of dataframes

using index positions - row index as well as column index

using labels - row labels as well as column labels

In [10]:
bric_dat_set_indx = pd.read_csv("brics.csv", index_col=0)
bric_dat_set_indx

           country    capital    area  population
Code
BR          Brazil   Brasilia   8.516      200.40
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
CH           China    Beijing   9.597     1357.00
SA    South Africa   Pretoria   1.221       52.98

In [12]:
#use labels to slice data: loc
bric_dat_set_indx.loc[["RU"]] # Give row value (index value) of column - Code which is an Index

     country capital  area  population
Code
RU    Russia  Moscow  17.1       143.5

In [ ]:
#use labels to slice data: loc
bric_dat_set_indx.loc[["RU","IN","BR"]] # Give row value (index value) of column - Code which is an Index. Array of labels

     country    capital    area  population
Code
RU    Russia     Moscow  17.100       143.5
IN     India  New Delhi   3.286      1252.0
BR    Brazil   Brasilia   8.516       200.4

In [14]:
#use labels to slice data: loc
bric_dat_set_indx.loc[["RU","IN","BR"], ["capital","area"]] #row,col

        capital    area
Code
RU       Moscow  17.100
IN    New Delhi   3.286
BR     Brasilia   8.516

In [15]:
bric_dat_set_indx.loc[["BR","RU"],["country"]]

     country
Code
BR    Brazil
RU    Russia

In [18]:
bric_dat_set_indx

           country    capital    area  population
Code
BR          Brazil   Brasilia   8.516      200.40
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
CH           China    Beijing   9.597     1357.00
SA    South Africa   Pretoria   1.221       52.98

In [ ]:
bric_dat_set_indx.iloc[[1,2],[3]] # supply row index and column index

      population
Code
RU         143.5
IN        1252.0

In [17]:
bric_dat_set_indx.iloc[1:3]

     country    capital    area  population
Code
RU    Russia     Moscow  17.100       143.5
IN     India  New Delhi   3.286      1252.0

In [41]:
bric_dat_set_indx['population'].mean()

np.float64(601.176)

In [20]:
bric_dat_set_indx.iloc[0]

country         Brazil
capital       Brasilia
area             8.516
population       200.4
Name: BR, dtype: object

In [21]:
bric_dat_set_indx.iloc[[0]]

     country   capital   area  population
Code
BR    Brazil  Brasilia  8.516       200.4

In [25]:
print(type(bric_dat_set_indx.iloc[0]))
print(type(bric_dat_set_indx.iloc[[0]]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

In [ ]:
bric_dat_set_indx.iloc[1:4,0:3] # rows 1 to 3 ,  cols 0 to 1

     country    capital    area
Code
RU    Russia     Moscow  17.100
IN     India  New Delhi   3.286
CH     China    Beijing   9.597

In [26]:
bric_dats1 = pd.read_csv("brics.csv")
bric_dats1

  Code       country    capital    area  population
0   BR        Brazil   Brasilia   8.516      200.40
1   RU        Russia     Moscow  17.100      143.50
2   IN         India  New Delhi   3.286     1252.00
3   CH         China    Beijing   9.597     1357.00
4   SA  South Africa   Pretoria   1.221       52.98

In [32]:
code_label_index = 'Code'
pos_code = bric_dats1.columns.get_loc(code_label_index)
print("Index label of 'Code' column : ",pos_code)

Index label of 'Code' column :  0

In [ ]:
bric_dats1.duplicated()

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [37]:
bric_dats1.drop_duplicates()

  Code       country    capital    area  population
0   BR        Brazil   Brasilia   8.516      200.40
1   RU        Russia     Moscow  17.100      143.50
2   IN         India  New Delhi   3.286     1252.00
3   CH         China    Beijing   9.597     1357.00
4   SA  South Africa   Pretoria   1.221       52.98

In [38]:
bric_dats1.duplicated(subset=['country'])

0    False
1    False
2    False
3    False
4    False
dtype: bool

In [40]:
bric_dats1.drop_duplicates(subset=['country'])

  Code       country    capital    area  population
0   BR        Brazil   Brasilia   8.516      200.40
1   RU        Russia     Moscow  17.100      143.50
2   IN         India  New Delhi   3.286     1252.00
3   CH         China    Beijing   9.597     1357.00
4   SA  South Africa   Pretoria   1.221       52.98

In [42]:
bric_dats1['population'].mean()

np.float64(601.176)

In [43]:
bric_dats1['population'].median()

np.float64(200.4)

In [ ]:
bric_dats1['population'].describe() # single column metrics

count       5.000000
mean      601.176000
std       645.261454
min        52.980000
25%       143.500000
50%       200.400000
75%      1252.000000
max      1357.000000
Name: population, dtype: float64

In [46]:
bric_dats1.describe()

            area   population
count   5.000000     5.000000
mean    7.944000   601.176000
std     6.200557   645.261454
min     1.221000    52.980000
25%     3.286000   143.500000
50%     8.516000   200.400000
75%     9.597000  1252.000000
max    17.100000  1357.000000

In [47]:
tit_ds1 = pd.read_csv("Titanic-Dataset.csv")
# on reading data in pandas there is always be an index column which is not actually part of the dataset.
tit_ds1

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [48]:
tit_ds1.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [50]:
tit_ds1["Fare"].describe()

count    891.000000
mean      32.204208
std       49.693429
min        0.000000
25%        7.910400
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

In [58]:
tit_ds1.groupby(["Pclass"])["Fare"].mean()

Pclass
1    84.154687
2    20.662183
3    13.675550
Name: Fare, dtype: float64

In [63]:
tit_ds1.groupby(["Pclass","Sex"])

In [64]:
tit_ds1.groupby(["Pclass","Sex"])[["Fare","Age"]].mean() #groups should be created for categorical columns.

                     Fare        Age
Pclass Sex
1      female  106.125798  34.611765
       male     67.226127  41.281386
2      female   21.970121  28.722973
       male     19.741782  30.740707
3      female   16.118810  21.750000
       male     12.661633  26.507589

In [ ]:
tit_ds1.sort_values(by="Age", ascending=True) #default

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
803,804,1,3,"Thomas, Master. Assad Alexander",male,0.42,0,1,2625,8.5167,NaN,C
755,756,1,2,"Hamalainen, Master. Viljo",male,0.67,1,1,250649,14.5000,NaN,S
469,470,1,3,"Baclini, Miss. Helene Barbara",female,0.75,2,1,2666,19.2583,NaN,C
644,645,1,3,"Baclini, Miss. Eugenie",female,0.75,2,1,2666,19.2583,NaN,C
78,79,1,2,"Caldwell, Master. Alden Gates",male,0.83,0,2,248738,29.0000,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [66]:
tit_ds1.sort_values(by="Age", ascending=False)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
630,631,1,1,"Barkworth, Mr. Algernon Henry Wilson",male,80.0,0,0,27042,30.0000,A23,S
851,852,0,3,"Svensson, Mr. Johan",male,74.0,0,0,347060,7.7750,NaN,S
493,494,0,1,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C
96,97,0,1,"Goldschmidt, Mr. George B",male,71.0,0,0,PC 17754,34.6542,A5,C
116,117,0,3,"Connors, Mr. Patrick",male,70.5,0,0,370369,7.7500,NaN,Q
...,...,...,...,...,...,...,...,...,...,...,...,...
859,860,0,3,"Razi, Mr. Raihed",male,NaN,0,0,2629,7.2292,NaN,C
863,864,0,3,"Sage, Miss. Dorothy Edith ""Dolly""",female,NaN,8,2,CA. 2343,69.5500,NaN,S
868,869,0,3,"van Melkebeke, Mr. Philemon",male,NaN,0,0,345777,9.5000,NaN,S
878,879,0,3,"Laleff, Mr. Kristo",male,NaN,0,0,349217,7.8958,NaN,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S

In [77]:
df_class_age = tit_ds1.sort_values(by=["Pclass","Age"], ascending=[True,False])
df_class_age[['Pclass','Age']]

     Pclass   Age
630       1  80.0
96        1  71.0
493       1  71.0
745       1  70.0
54        1  65.0
..      ...   ...
859       3   NaN
863       3   NaN
868       3   NaN
878       3   NaN
888       3   NaN

[891 rows x 2 columns]